xfsmart/betaflight/src/platform/common/stm32/config_flash.c
Note that FLASH_BANK_SIZE constant used in the following code changes depending on
bank operation mode. The code assumes dual bank operation, in which case the
FLASH_BANK_SIZE constant is set to one half of the available flash size in HAL.
*/

#if defined(STM32H743xx) || defined(STM32H723xx) || defined(STM32H725xx) || defined(STM32H735xx) || defined(STM32H757xx)
#define FLASH_PAGE_PER_BANK 8
#elif defined(STM32H7A3xx) || defined(STM32H7A3xxQ)
#define FLASH_PAGE_PER_BANK 128
#elif defined(STM32G4)
#define FLASH_PAGE_PER_BANK 128
// These are not defined in CMSIS like H7
#define FLASH_BANK1_BASE FLASH_BASE
#define FLASH_BANK2_BASE (FLASH_BANK1_BASE + FLASH_BANK_SIZE)
#elif defined(STM32H5)
#define FLASH_PAGE_PER_BANK 128
// These are not defined in CMSIS for H5
#define FLASH_BANK1_BASE FLASH_BASE
#define FLASH_BANK2_BASE (FLASH_BANK1_BASE + FLASH_BANK_SIZE)
#elif defined(STM32C5)
#define FLASH_PAGE_PER_BANK 128
// These are not defined in CMSIS for C5
#define FLASH_BANK1_BASE FLASH_BASE
#define FLASH_BANK2_BASE (FLASH_BANK1_BASE + FLASH_BANK_SIZE)
#endif

#if defined(FLASH_PAGE_PER_BANK) && !defined(STM32G4) && !defined(STM32H5) && !defined(STM32C5)
// G4/H5 FLASH_BANK_SIZE is runtime-computed from flash size register, so cannot be used in static assertion
_Static_assert(FLASH_BANK_SIZE == (FLASH_PAGE_SIZE * FLASH_PAGE_PER_BANK), "FLASH bank/page configuration mismatch");
#endif

void getFLASHSectorForEEPROM(uint32_t address, uint32_t *bank, uint32_t *sector)
{
#if defined(FLASH_BANK2_BASE)
    if (address >= FLASH_BANK1_BASE && address < FLASH_BANK2_BASE) {
        *bank = FLASH_BANK_1;
    } else if (address >= FLASH_BANK2_BASE && address < FLASH_BANK2_BASE + FLASH_BANK_SIZE) {
        *bank = FLASH_BANK_2;
        address -= FLASH_BANK_SIZE;
    }
#else
    if (address >= FLASH_BANK1_BASE && address < FLASH_BANK1_BASE + FLASH_BANK_SIZE) {
        *bank = FLASH_BANK_1;
    }
#endif
    else {
        // Not good
        while (1) {
            failureMode(FAILURE_CONFIG_STORE_FAILURE);
        }
    }

    address -= FLASH_BANK1_BASE;
    *sector = address / FLASH_PAGE_SIZE;
}
#elif defined(STM32H750xx)
/*
The memory map supports 2 banks of 8 128k sectors like the H743xx, but there is only one 128K sector so we save some code
space by using a smaller function.

Bank 1
Sector 0    0x08000000 - 0x0801FFFF 128 Kbytes

*/

void getFLASHSectorForEEPROM(uint32_t *bank, uint32_t *sector)
{

    uint32_t start = (uint32_t)&__config_start;

    if (start == FLASH_BANK1_BASE) {
        *sector = FLASH_SECTOR_0;
        *bank = FLASH_BANK_1;
    } else {
        // Not good
        while (1) {
            failureMode(FAILURE_CONFIG_STORE_FAILURE);
        }
    }
}
#elif defined(APM32F4)
/*
Sector 0    0x08000000 - 0x08003FFF 16 Kbytes
Sector 1    0x08004000 - 0x08007FFF 16 Kbytes
Sector 2    0x08008000 - 0x0800BFFF 16 Kbytes
Sector 3    0x0800C000 - 0x0800FFFF 16 Kbytes
Sector 4    0x08010000 - 0x0801FFFF 64 Kbytes
Sector 5    0x08020000 - 0x0803FFFF 128 Kbytes
Sector 6    0x08040000 - 0x0805FFFF 128 Kbytes
Sector 7    0x08060000 - 0x0807FFFF 128 Kbytes
Sector 8    0x08080000 - 0x0809FFFF 128 Kbytes
Sector 9    0x080A0000 - 0x080BFFFF 128 Kbytes
Sector 10   0x080C0000 - 0x080DFFFF 128 Kbytes
Sector 11   0x080E0000 - 0x080FFFFF 128 Kbytes
*/

uint32_t getFLASHSectorForEEPROM(void)
{
    if ((uint32_t)&__config_start <= 0x08003FFF)
        return FLASH_SECTOR_0;
    if ((uint32_t)&__config_start <= 0x08007FFF)
        return FLASH_SECTOR_1;
    if ((uint32_t)&__config_start <= 0x0800BFFF)
        return FLASH_SECTOR_2;
    if ((uint32_t)&__config_start <= 0x0800FFFF)
        return FLASH_SECTOR_3;
    if ((uint32_t)&__config_start <= 0x0801FFFF)
        return FLASH_SECTOR_4;
    if ((uint32_t)&__config_start <= 0x0803FFFF)
        return FLASH_SECTOR_5;
    if ((uint32_t)&__config_start <= 0x0805FFFF)
        return FLASH_SECTOR_6;
    if ((uint32_t)&__config_start <= 0x0807FFFF)
        return FLASH_SECTOR_7;
    if ((uint32_t)&__config_start <= 0x0809FFFF)
        return FLASH_SECTOR_8;
    if ((uint32_t)&__config_start <= 0x080DFFFF)
        return FLASH_SECTOR_9;
    if ((uint32_t)&__config_start <= 0x080BFFFF)
        return FLASH_SECTOR_10;
    if ((uint32_t)&__config_start <= 0x080FFFFF)
        return FLASH_SECTOR_11;

    // Not good
    while (1) {
        failureMode(FAILURE_CONFIG_STORE_FAILURE);
    }
}
#endif

#if defined(X32M7)
#define X32_FLASH_ERASE_SIZE FLASH_PAGE_SIZE

static bool x32ConfigAddressIsValid(uintptr_t address, size_t length)
{
    const uintptr_t configStart = (uintptr_t)&__config_start;
    const uintptr_t configEnd = (uintptr_t)&__config_end;

    return length <= (UINTPTR_MAX - address) &&
        address >= configStart &&
        (address + length) <= configEnd;
}

static configStreamerResult_e x32FlashStatusToConfigResult(uint32_t status)
{
    switch (status) {
    case FLASH_SUCCESS:
        return CONFIG_RESULT_SUCCESS;
    case FLASH_BUS_ADDR_ERROR:
    case FLASH_LOGIC_ADDR_ERROR:
        return CONFIG_RESULT_ADDRESS_INVALID;
    case FLASH_FAILED:
        return CONFIG_RESULT_INCOMPLETE;
    default:
        return CONFIG_RESULT_FAILURE;
    }
}

static configStreamerResult_e x32EraseFlashIfNeeded(uintptr_t address)
{
    if ((address % X32_FLASH_ERASE_SIZE) != 0) {
        return CONFIG_RESULT_SUCCESS;
    }

    return x32FlashStatusToConfigResult(SMU_EraseFlash((uint32_t)address));
}
#endif

void configUnlock(void)
{
#if defined(STM32F7) || defined(STM32H7) || defined(STM32H5) || defined(STM32C5) || defined(STM32G4)
    HAL_FLASH_Unlock();
#elif defined(X32M7)
    // NOP
#elif defined(APM32F4)
    DAL_FLASH_Unlock();
#elif defined(AT32F4)
    flash_unlock();
#elif defined(FT32F4)
    FLASH_Unlock();
#else
    FLASH_Unlock();
#endif
}

void configLock(void)
{
#if defined(STM32F7) || defined(STM32H7) || defined(STM32H5) || defined(STM32C5) || defined(STM32G4)
        HAL_FLASH_Lock();
#if defined(STM32H5)
        // On H5 the instruction cache also caches const/data reads from the
        // flash code region, which includes the config storage area. After
        // rewriting config, invalidate ICACHE so subsequent reads are coherent
        // instead of being served from stale cache lines.
        HAL_ICACHE_Invalidate();
#endif
#if defined(STM32C5)
        // On C5 the instruction cache also caches const/data reads from the
        // flash code region, which includes the config storage area. After
        // rewriting config, invalidate ICACHE so subsequent reads are coherent
        // instead of being served from stale cache lines. CMSIS-direct (the C5
        // HAL2 has no ICACHE wrapper); bounded wait so a stuck flag can't hang.
        //
        // Clear any stale busy-end flag first (e.g. left set by the power-on
        // auto-invalidation) — otherwise the wait below would see BSYENDF
        // already set and exit before THIS invalidation completes, leaving the
        // cache with stale config lines.
        WRITE_REG(ICACHE->FCR, ICACHE_FCR_CBSYENDF);
        SET_BIT(ICACHE->CR, ICACHE_CR_CACHEINV);
        for (volatile uint32_t icacheWait = 0;
             icacheWait < 1000000U && !(ICACHE->SR & ICACHE_SR_BSYENDF);
             icacheWait++) { }
        WRITE_REG(ICACHE->FCR, ICACHE_FCR_CBSYENDF);
        __DSB();
        __ISB();
#endif
#elif defined(X32M7)
        // NOP
#elif defined(AT32F4)
        flash_lock();
#elif defined(APM32F4)
        DAL_FLASH_Lock();
#elif defined(FT32F4)
        FLASH_Lock();
#else
        FLASH_Lock();
#endif
}

void configClearFlags(void)
{
#if defined(STM32F4)
    FLASH_ClearFlag(FLASH_FLAG_EOP | FLASH_FLAG_OPERR | FLASH_FLAG_WRPERR | FLASH_FLAG_PGAERR | FLASH_FLAG_PGPERR | FLASH_FLAG_PGSERR);
#elif defined(FT32F4)
    FLASH_ClearFlag(FLASH_FLAG_EOP | FLASH_FLAG_PGERR | FLASH_FLAG_PGSERR | FLASH_FLAG_WRPERR);
#elif defined(STM32F7)
    // NOP
#elif defined(STM32H7)
    // NOP
#elif defined(STM32H5)
    // NOP
#elif defined(STM32C5)
    // NOP
#elif defined(STM32G4)
    // NOP
#elif defined(AT32F4)
    flash_flag_clear(FLASH_ODF_FLAG | FLASH_PRGMERR_FLAG | FLASH_EPPERR_FLAG);
#elif defined(APM32F4)
    __DAL_FLASH_CLEAR_FLAG(FLASH_FLAG_EOP | FLASH_FLAG_OPERR | FLASH_FLAG_WRPERR | FLASH_FLAG_PGAERR | FLASH_FLAG_PGPERR | FLASH_FLAG_PGSERR);
#elif defined(X32M7)
    // SMU flash operations return status directly.
#elif defined(UNIT_TEST) || defined(SIMULATOR_BUILD)
    // NOP
#else
# error "Unsupported CPU"
#endif
}

#if defined(FT32F4) && defined(FT32_CACHE_ENABLE) && FT32_CACHE_ENABLE
#define FT32_CONFIG_CACHE_STATE_ICACHE        (1U << 0)
#define FT32_CONFIG_CACHE_STATE_DCACHE        (1U << 1)
#define FT32_CONFIG_CACHE_TRANSITION_TIMEOUT  1000000U
#define FT32_CONFIG_CACHE_CS_DISABLED         (0U << CACHE_SR_CS_Pos)
#define FT32_CONFIG_CACHE_CS_ENABLED          (2U << CACHE_SR_CS_Pos)
#define FT32_CONFIG_CACHE_IRQ_ERROR_MASK      (CACHE_IRQSTAT_POWERR_Msk | CACHE_IRQSTAT_MANINVERR_Msk)
#endif

