xfsmart/betaflight/src/platform/common/stm32/config_flash.c
#if defined(FT32F4)
__attribute__((section(".ram_code"))) NOINLINE __attribute__((noipa))
#endif
configStreamerResult_e configWriteWord(uintptr_t address, config_streamer_buffer_type_t *buffer)
{
#if defined(STM32H7)
    if (address % FLASH_PAGE_SIZE == 0) {
        FLASH_EraseInitTypeDef EraseInitStruct = {
            .TypeErase     = FLASH_TYPEERASE_SECTORS,
#if !(defined(STM32H7A3xx) || defined(STM32H7A3xxQ))
            .VoltageRange  = FLASH_VOLTAGE_RANGE_3, // 2.7-3.6V
#endif
            .NbSectors     = 1
        };
        getFLASHSectorForEEPROM(address, &EraseInitStruct.Banks, &EraseInitStruct.Sector);
        uint32_t SECTORError;
        const HAL_StatusTypeDef status = HAL_FLASHEx_Erase(&EraseInitStruct, &SECTORError);
        if (status != HAL_OK) {
            return CONFIG_RESULT_FAILURE;
        }
    }

    // For H7
    // HAL_StatusTypeDef HAL_FLASH_Program(uint32_t TypeProgram, uint32_t Address, uint32_t DataAddress);
    STATIC_ASSERT(CONFIG_STREAMER_BUFFER_SIZE == sizeof(uint32_t) * FLASH_NB_32BITWORD_IN_FLASHWORD,  "CONFIG_STREAMER_BUFFER_SIZE does not match written size");
    const HAL_StatusTypeDef status = HAL_FLASH_Program(FLASH_TYPEPROGRAM_FLASHWORD, address, (uint32_t)buffer);
    if (status != HAL_OK) {
        return CONFIG_RESULT_ADDRESS_INVALID;
    }
#elif defined(STM32F7)
    if (address % FLASH_PAGE_SIZE == 0) {
        FLASH_EraseInitTypeDef EraseInitStruct = {
            .TypeErase     = FLASH_TYPEERASE_SECTORS,
            .VoltageRange  = FLASH_VOLTAGE_RANGE_3, // 2.7-3.6V
            .NbSectors     = 1
        };
        EraseInitStruct.Sector = getFLASHSectorForEEPROM();
        uint32_t SECTORError;
        const HAL_StatusTypeDef status = HAL_FLASHEx_Erase(&EraseInitStruct, &SECTORError);
        if (status != HAL_OK) {
            return CONFIG_RESULT_FAILURE;
        }
    }

    STATIC_ASSERT(CONFIG_STREAMER_BUFFER_SIZE == sizeof(uint32_t),  "CONFIG_STREAMER_BUFFER_SIZE does not match written size");
    // For F7
    // HAL_StatusTypeDef HAL_FLASH_Program(uint32_t TypeProgram, uint32_t Address, uint64_t Data);
    const HAL_StatusTypeDef status = HAL_FLASH_Program(FLASH_TYPEPROGRAM_WORD, address, *buffer);
    if (status != HAL_OK) {
        return CONFIG_RESULT_INCOMPLETE;
    }
#elif defined(STM32H5)
    if (address % FLASH_PAGE_SIZE == 0) {
        FLASH_EraseInitTypeDef EraseInitStruct = {
            .TypeErase     = FLASH_TYPEERASE_SECTORS,
            .NbSectors     = 1
        };
        getFLASHSectorForEEPROM(address, &EraseInitStruct.Banks, &EraseInitStruct.Sector);
        uint32_t SECTORError;
        const HAL_StatusTypeDef status = HAL_FLASHEx_Erase(&EraseInitStruct, &SECTORError);
        if (status != HAL_OK) {
            return CONFIG_RESULT_FAILURE;
        }
    }

    // H5 programs 128 bits (quad-word) at a time; DataAddress points to 4 x uint32_t
    STATIC_ASSERT(CONFIG_STREAMER_BUFFER_SIZE == 16,  "CONFIG_STREAMER_BUFFER_SIZE does not match written size");
    const HAL_StatusTypeDef status = HAL_FLASH_Program(FLASH_TYPEPROGRAM_QUADWORD, address, (uint32_t)buffer);
    if (status != HAL_OK) {
        return CONFIG_RESULT_ADDRESS_INVALID;
    }
#elif defined(STM32G4)
    if (address % FLASH_PAGE_SIZE == 0) {

        FLASH_EraseInitTypeDef EraseInitStruct = {
            .TypeErase     = FLASH_TYPEERASE_PAGES,
            .NbPages       = 1
        };
        getFLASHSectorForEEPROM(address, &EraseInitStruct.Banks, &EraseInitStruct.Page);
        uint32_t SECTORError;
        const HAL_StatusTypeDef status = HAL_FLASHEx_Erase(&EraseInitStruct, &SECTORError);
        if (status != HAL_OK) {
            return CONFIG_RESULT_FAILURE;
        }
    }

    STATIC_ASSERT(CONFIG_STREAMER_BUFFER_SIZE == sizeof(uint64_t),  "CONFIG_STREAMER_BUFFER_SIZE does not match written size");
    const HAL_StatusTypeDef status = HAL_FLASH_Program(FLASH_TYPEPROGRAM_DOUBLEWORD, address, *buffer);
    if (status != HAL_OK) {
        return CONFIG_RESULT_ADDRESS_INVALID;
    }
#elif defined(AT32F4)
    if (address % FLASH_PAGE_SIZE == 0) {
        const flash_status_type status = flash_sector_erase(address);
        if (status != FLASH_OPERATE_DONE) {
            return CONFIG_RESULT_FAILURE;
        }
    }

    STATIC_ASSERT(CONFIG_STREAMER_BUFFER_SIZE == sizeof(uint32_t),  "CONFIG_STREAMER_BUFFER_SIZE does not match written size");
    const flash_status_type status = flash_word_program(address, *buffer);
    if (status != FLASH_OPERATE_DONE) {
        return CONFIG_RESULT_ADDRESS_INVALID;
    }
#elif defined(APM32F4)
    if (address % FLASH_PAGE_SIZE == 0) {
        FLASH_EraseInitTypeDef EraseInitStruct = {
            .TypeErase     = FLASH_TYPEERASE_SECTORS,
            .VoltageRange  = FLASH_VOLTAGE_RANGE_3, // 2.7-3.6V
            .NbSectors     = 1
        };
        EraseInitStruct.Sector = getFLASHSectorForEEPROM();
        uint32_t SECTORError;
        const DAL_StatusTypeDef status = DAL_FLASHEx_Erase(&EraseInitStruct, &SECTORError);
        if (status != DAL_OK) {
            return CONFIG_RESULT_FAILURE;
        }
    }

    STATIC_ASSERT(CONFIG_STREAMER_BUFFER_SIZE == sizeof(uint32_t),  "CONFIG_STREAMER_BUFFER_SIZE does not match written size");
    const DAL_StatusTypeDef status = DAL_FLASH_Program(FLASH_TYPEPROGRAM_WORD, address, *buffer);
    if (status != DAL_OK) {
        return CONFIG_RESULT_ADDRESS_INVALID;
    }
#elif defined(X32M7)
    STATIC_ASSERT(CONFIG_STREAMER_BUFFER_SIZE == sizeof(uint32_t),  "CONFIG_STREAMER_BUFFER_SIZE does not match written size");

    if (!x32ConfigAddressIsValid(address, CONFIG_STREAMER_BUFFER_SIZE) || (address % sizeof(uint32_t)) != 0) {
        return CONFIG_RESULT_ADDRESS_INVALID;
    }

    const configStreamerResult_e eraseResult = x32EraseFlashIfNeeded(address);
    if (eraseResult != CONFIG_RESULT_SUCCESS) {
        return eraseResult;
    }

    return x32FlashStatusToConfigResult(SMU_WriteFlash((uint32_t)address, (uint8_t *)buffer, CONFIG_STREAMER_BUFFER_SIZE));
#elif defined(STM32F4)
    if (address % FLASH_PAGE_SIZE == 0) {
        const FLASH_Status status = FLASH_EraseSector(getFLASHSectorForEEPROM(), VoltageRange_3); //0x08080000 to 0x080A0000
        if (status != FLASH_COMPLETE) {
            return CONFIG_RESULT_FAILURE;
        }
    }

    STATIC_ASSERT(CONFIG_STREAMER_BUFFER_SIZE == sizeof(uint32_t),  "CONFIG_STREAMER_BUFFER_SIZE does not match written size");
    const FLASH_Status status = FLASH_ProgramWord(address, *buffer);
    if (status != FLASH_COMPLETE) {
        return CONFIG_RESULT_ADDRESS_INVALID;
    }
#elif defined(FT32F4)
    STATIC_ASSERT(CONFIG_STREAMER_BUFFER_SIZE == sizeof(uint32_t),  "CONFIG_STREAMER_BUFFER_SIZE does not match written size");

    const uint32_t data = *buffer;
    const uintptr_t configStart = (uintptr_t)&__config_start;
    const uintptr_t configEnd = (uintptr_t)&__config_end;
    const uint32_t clearFlags = FLASH_FR_EOP | FLASH_FR_PGERR | FLASH_FR_PGSERR | FLASH_FR_WRPRTERR;
    const uint32_t operationMask = FLASH_WRC_PG | FLASH_WRC_PER | FLASH_WRC_MER | FLASH_WRC_STRT
        | FLASH_WRC_PNB_Msk | FLASH_WRC_ESIZE_0 | FLASH_WRC_ESIZE_1;
    configStreamerResult_e result = CONFIG_RESULT_SUCCESS;
#if defined(FT32_CACHE_ENABLE) && FT32_CACHE_ENABLE
    uint32_t cacheState = 0U;
#endif

