xfsmart/betaflight/src/platform/common/stm32/config_flash.c
    if ((address & (sizeof(uint32_t) - 1U)) != 0U
        || address < configStart
        || address > configEnd - sizeof(uint32_t)
        || (FLASH->WRC & FLASH_WRC_LOCK) != 0U) {
        return CONFIG_RESULT_ADDRESS_INVALID;
    }

    RCC->CR |= RCC_CR_HSION;
    uint32_t timeout = FLASH_ER_PRG_TIMEOUT;
    while ((RCC->CR & RCC_CR_HSIRDY) == 0U && timeout != 0U) {
        timeout--;
    }
    if ((RCC->CR & RCC_CR_HSIRDY) == 0U) {
        return CONFIG_RESULT_TIMEOUT;
    }

    const uint32_t savedPrimask = __get_PRIMASK();
    __disable_irq();
    __DSB();
    __ISB();

#if defined(FT32_CACHE_ENABLE) && FT32_CACHE_ENABLE
    // Flash data/code may be resident in the FT32 D/I caches.  Disable both
    // with a call-free SRAM sequence while this routine changes Flash.
    if ((ICACHE->ICACHE_CTRL & CACHE_CTRL_CEN_Msk) != 0U) {
        cacheState |= FT32_CONFIG_CACHE_STATE_ICACHE;
    }
    if ((DCACHE->DCACHE_CTRL & CACHE_CTRL_CEN_Msk) != 0U) {
        cacheState |= FT32_CONFIG_CACHE_STATE_DCACHE;
    }

    DCACHE->DCACHE_CTRL &= ~CACHE_CTRL_CEN_Msk;
    ICACHE->ICACHE_CTRL &= ~CACHE_CTRL_CEN_Msk;
    __DSB();

    timeout = FT32_CONFIG_CACHE_TRANSITION_TIMEOUT;
    while ((ICACHE->ICACHE_SR & CACHE_SR_CS_Msk) != FT32_CONFIG_CACHE_CS_DISABLED && timeout != 0U) {
        timeout--;
    }
    if ((ICACHE->ICACHE_SR & CACHE_SR_CS_Msk) != FT32_CONFIG_CACHE_CS_DISABLED) {
        goto ft32FlashReset;
    }

    timeout = FT32_CONFIG_CACHE_TRANSITION_TIMEOUT;
    while ((DCACHE->DCACHE_SR & CACHE_SR_CS_Msk) != FT32_CONFIG_CACHE_CS_DISABLED && timeout != 0U) {
        timeout--;
    }
    if ((DCACHE->DCACHE_SR & CACHE_SR_CS_Msk) != FT32_CONFIG_CACHE_CS_DISABLED) {
        goto ft32FlashReset;
    }

    __ISB();
#endif

    timeout = FLASH_ER_PRG_TIMEOUT;
    while ((FLASH->FR & FLASH_FR_BSY) != 0U && timeout != 0U) {
        timeout--;
    }
    if ((FLASH->FR & FLASH_FR_BSY) != 0U) {
        goto ft32FlashReset;
    }
    if (timeout == 0U) {
        result = CONFIG_RESULT_TIMEOUT;
        goto ft32FlashRestorePrimask;
    }

    if ((address % FLASH_PAGE_SIZE) == 0U) {
        const uint32_t page = (uint32_t)((address - FLASH_BASE) / FLASH_PAGE_SIZE);
        uint32_t wrc = FLASH->WRC & ~operationMask;

        FLASH->FR = clearFlags;
        wrc |= FLASH_WRC_PER | (page << FLASH_WRC_PNB_Pos);
        FLASH->WRC = wrc;
        FLASH->WRC = wrc | FLASH_WRC_STRT;

        timeout = FLASH_ER_PRG_TIMEOUT;
        while ((FLASH->FR & FLASH_FR_BSY) != 0U && timeout != 0U) {
            timeout--;
        }
        if ((FLASH->FR & FLASH_FR_BSY) != 0U) {
            goto ft32FlashReset;
        }

        const uint32_t eraseStatus = FLASH->FR;
        FLASH->WRC &= ~(FLASH_WRC_PER | FLASH_WRC_STRT | FLASH_WRC_PNB_Msk | FLASH_WRC_ESIZE_0 | FLASH_WRC_ESIZE_1);

        if (timeout == 0U) {
            result = CONFIG_RESULT_TIMEOUT;
            goto ft32FlashRestorePrimask;
        }
        if ((eraseStatus & FLASH_FR_WRPRTERR) != 0U) {
            result = CONFIG_RESULT_ADDRESS_INVALID;
            goto ft32FlashRestorePrimask;
        }
        if ((eraseStatus & (FLASH_FR_PGERR | FLASH_FR_PGSERR)) != 0U) {
            result = CONFIG_RESULT_FAILURE;
            goto ft32FlashRestorePrimask;
        }

        const volatile uint32_t *erased = (const volatile uint32_t *)address;
        for (unsigned i = 0; i < FLASH_PAGE_SIZE / sizeof(uint32_t); i++) {
            if (erased[i] != UINT32_MAX) {
                result = CONFIG_RESULT_FAILURE;
                goto ft32FlashRestorePrimask;
            }
        }
    }

    FLASH->FR = clearFlags;
    FLASH->WRC = (FLASH->WRC & ~operationMask) | FLASH_WRC_PG;
    *(volatile uint32_t *)address = data;

    timeout = FLASH_ER_PRG_TIMEOUT;
    while ((FLASH->FR & FLASH_FR_BSY) != 0U && timeout != 0U) {
        timeout--;
    }
    if ((FLASH->FR & FLASH_FR_BSY) != 0U) {
        goto ft32FlashReset;
    }

    const uint32_t programStatus = FLASH->FR;
    FLASH->WRC &= ~FLASH_WRC_PG;

    if (timeout == 0U) {
        result = CONFIG_RESULT_TIMEOUT;
    } else if ((programStatus & FLASH_FR_WRPRTERR) != 0U) {
        result = CONFIG_RESULT_ADDRESS_INVALID;
    } else if ((programStatus & (FLASH_FR_PGERR | FLASH_FR_PGSERR)) != 0U
        || *(const volatile uint32_t *)address != data) {
        result = CONFIG_RESULT_INCOMPLETE;
    }

ft32FlashRestorePrimask:
#if defined(FT32_CACHE_ENABLE) && FT32_CACHE_ENABLE
    if (cacheState != 0U) {
        bool cacheRestoreSucceeded = true;

        // Re-establish the disabled state before invalidation and re-enable.
        DCACHE->DCACHE_CTRL &= ~CACHE_CTRL_CEN_Msk;
        ICACHE->ICACHE_CTRL &= ~CACHE_CTRL_CEN_Msk;
        __DSB();

        timeout = FT32_CONFIG_CACHE_TRANSITION_TIMEOUT;
        while ((ICACHE->ICACHE_SR & CACHE_SR_CS_Msk) != FT32_CONFIG_CACHE_CS_DISABLED && timeout != 0U) {
            timeout--;
        }
        if ((ICACHE->ICACHE_SR & CACHE_SR_CS_Msk) != FT32_CONFIG_CACHE_CS_DISABLED) {
            goto ft32FlashReset;
        }

        timeout = FT32_CONFIG_CACHE_TRANSITION_TIMEOUT;
        while ((DCACHE->DCACHE_SR & CACHE_SR_CS_Msk) != FT32_CONFIG_CACHE_CS_DISABLED && timeout != 0U) {
            timeout--;
        }
        if ((DCACHE->DCACHE_SR & CACHE_SR_CS_Msk) != FT32_CONFIG_CACHE_CS_DISABLED) {
            goto ft32FlashReset;
        }

        timeout = FT32_CONFIG_CACHE_TRANSITION_TIMEOUT;
        while ((((ICACHE->ICACHE_CTRL & CACHE_CTRL_INV_Msk) != 0U)
            || ((ICACHE->ICACHE_SR & CACHE_SR_INVST_Msk) != 0U)) && timeout != 0U) {
            timeout--;
        }
        if (((ICACHE->ICACHE_CTRL & CACHE_CTRL_INV_Msk) != 0U)
            || ((ICACHE->ICACHE_SR & CACHE_SR_INVST_Msk) != 0U)) {
            cacheRestoreSucceeded = false;
        }

        timeout = FT32_CONFIG_CACHE_TRANSITION_TIMEOUT;
        while ((((DCACHE->DCACHE_CTRL & CACHE_CTRL_INV_Msk) != 0U)
            || ((DCACHE->DCACHE_SR & CACHE_SR_INVST_Msk) != 0U)) && timeout != 0U) {
            timeout--;
        }
        if (((DCACHE->DCACHE_CTRL & CACHE_CTRL_INV_Msk) != 0U)
            || ((DCACHE->DCACHE_SR & CACHE_SR_INVST_Msk) != 0U)) {
            cacheRestoreSucceeded = false;
        }

