xfsmart/betaflight/src/platform/common/stm32/config_flash.c
        if (cacheRestoreSucceeded) {
            ICACHE->ICACHE_IRQSTAT = FT32_CONFIG_CACHE_IRQ_ERROR_MASK;
            DCACHE->DCACHE_IRQSTAT = FT32_CONFIG_CACHE_IRQ_ERROR_MASK;
            __DSB();

            if (((ICACHE->ICACHE_IRQSTAT | DCACHE->DCACHE_IRQSTAT)
                & FT32_CONFIG_CACHE_IRQ_ERROR_MASK) != 0U) {
                cacheRestoreSucceeded = false;
            }
        }

        if (cacheRestoreSucceeded) {
            if ((cacheState & FT32_CONFIG_CACHE_STATE_DCACHE) != 0U) {
                DCACHE->DCACHE_CTRL |= CACHE_CTRL_CEN_Msk;
            }
            if ((cacheState & FT32_CONFIG_CACHE_STATE_ICACHE) != 0U) {
                ICACHE->ICACHE_CTRL |= CACHE_CTRL_CEN_Msk;
            }
            __DSB();

            if ((cacheState & FT32_CONFIG_CACHE_STATE_DCACHE) != 0U) {
                timeout = FT32_CONFIG_CACHE_TRANSITION_TIMEOUT;
                while ((DCACHE->DCACHE_SR & CACHE_SR_CS_Msk) != FT32_CONFIG_CACHE_CS_ENABLED && timeout != 0U) {
                    timeout--;
                }
                if ((DCACHE->DCACHE_SR & CACHE_SR_CS_Msk) != FT32_CONFIG_CACHE_CS_ENABLED) {
                    cacheRestoreSucceeded = false;
                }
            }

            if ((cacheState & FT32_CONFIG_CACHE_STATE_ICACHE) != 0U) {
                timeout = FT32_CONFIG_CACHE_TRANSITION_TIMEOUT;
                while ((ICACHE->ICACHE_SR & CACHE_SR_CS_Msk) != FT32_CONFIG_CACHE_CS_ENABLED && timeout != 0U) {
                    timeout--;
                }
                if ((ICACHE->ICACHE_SR & CACHE_SR_CS_Msk) != FT32_CONFIG_CACHE_CS_ENABLED) {
                    cacheRestoreSucceeded = false;
                }
            }

            if (((ICACHE->ICACHE_IRQSTAT | DCACHE->DCACHE_IRQSTAT)
                & FT32_CONFIG_CACHE_IRQ_ERROR_MASK) != 0U) {
                cacheRestoreSucceeded = false;
            }
        }

        if (!cacheRestoreSucceeded) {
            // Return to Flash only after both controllers are confirmed off.
            DCACHE->DCACHE_CTRL &= ~CACHE_CTRL_CEN_Msk;
            ICACHE->ICACHE_CTRL &= ~CACHE_CTRL_CEN_Msk;
            __DSB();

            timeout = FT32_CONFIG_CACHE_TRANSITION_TIMEOUT;
            while ((ICACHE->ICACHE_SR & CACHE_SR_CS_Msk) != FT32_CONFIG_CACHE_CS_DISABLED && timeout != 0U) {
                timeout--;
            }
            if ((ICACHE->ICACHE_SR & CACHE_SR_CS_Msk) != FT32_CONFIG_CACHE_CS_DISABLED) {
                goto ft32FlashReset;
            }

            timeout = FT32_CONFIG_CACHE_TRANSITION_TIMEOUT;
            while ((DCACHE->DCACHE_SR & CACHE_SR_CS_Msk) != FT32_CONFIG_CACHE_CS_DISABLED && timeout != 0U) {
                timeout--;
            }
            if ((DCACHE->DCACHE_SR & CACHE_SR_CS_Msk) != FT32_CONFIG_CACHE_CS_DISABLED) {
                goto ft32FlashReset;
            }

            ICACHE->ICACHE_IRQSTAT = FT32_CONFIG_CACHE_IRQ_ERROR_MASK;
            DCACHE->DCACHE_IRQSTAT = FT32_CONFIG_CACHE_IRQ_ERROR_MASK;
            __DSB();
        }
    }

    __ISB();
#endif
    __DSB();
    __set_PRIMASK(savedPrimask);
    __ISB();
    return result;

ft32FlashReset:
    {
        // A stuck controller cannot safely return to code stored in Flash.
        volatile uint32_t *const aircr = &SCB->AIRCR;
        const uint32_t priorityGroup = *aircr & SCB_AIRCR_PRIGROUP_Msk;

        __DSB();
        *aircr = priorityGroup
            | (0x5FAUL << SCB_AIRCR_VECTKEY_Pos)
            | SCB_AIRCR_SYSRESETREQ_Msk;
        __DSB();
        __asm volatile ("1: b 1b" ::: "memory");
        __builtin_unreachable();
    }
#elif defined(STM32C5)
    if (address % FLASH_PAGE_SIZE == 0) {
        FLASH_EraseInitTypeDef EraseInitStruct = {
            .TypeErase     = FLASH_TYPEERASE_SECTORS,
            .NbSectors     = 1
        };
        getFLASHSectorForEEPROM(address, &EraseInitStruct.Banks, &EraseInitStruct.Sector);
        uint32_t SECTORError;
        const HAL_StatusTypeDef status = HAL_FLASHEx_Erase(&EraseInitStruct, &SECTORError);
        if (status != HAL_OK) {
            return CONFIG_RESULT_FAILURE;
        }
    }

    // C5 programs 128 bits (quad-word) at a time; DataAddress points to 4 x uint32_t
    STATIC_ASSERT(CONFIG_STREAMER_BUFFER_SIZE == 16,  "CONFIG_STREAMER_BUFFER_SIZE does not match written size");
    const HAL_StatusTypeDef status = HAL_FLASH_Program(FLASH_TYPEPROGRAM_QUADWORD, address, (uint32_t)buffer);
    if (status != HAL_OK) {
        return CONFIG_RESULT_ADDRESS_INVALID;
    }
#else
#error "MCU not catered for in configWriteWord for config_streamer"
#endif
    return CONFIG_RESULT_SUCCESS;
}

#endif // CONFIG_IN_FLASH
